// JavaScript Document
var i=0;
window.onload=function(){
	var iNO = document.getElementById("iNO");
	var iOK = document.getElementById("iOK");
	var iTEXT = document.getElementById("iTEXT");
	iNO.onclick=function(){
		i++;
		if(i==1){
			   iTEXT.innerHTML = "~ 一生一世爱你&#10084;&#65039; ~";
			   alert("~ 一生一世爱你 ~")
		}else if(i==2){
			   iTEXT.innerHTML = "~ 一辈子宠着你&#10084;&#65039; ~";
			   alert("~ 一辈子宠着你 ~")
		}else if(i==3){
			   iTEXT.innerHTML = "~ 家务我全干&#9732;&#65039; ~";
			   alert("~ 家务我全干 ~")
		}else if(i==4){
			iTEXT.innerHTML = "~ 你一定要同意&#128546; ~";
			alert("~ 你一定要同意 ~")
		}else if(i==5){
			iTEXT.innerHTML = "~ 不藏私房钱&#128176; ~";
			alert("~ 不藏私房钱 ~")
		}else if(i==6){
			iTEXT.innerHTML = "~ 房子写你名&#127968; ~";
			alert("~ 房子写你名 ~")
		}else if(i==8){
			iTEXT.innerHTML = "~ 管饭管够管饱&#127834; ~";
			alert("~ 管饭管够管饱 ~")
        }else if(i==7){
			iTEXT.innerHTML = "~ 给你买大&#128141; ~";
			alert("~ 给你买大 ~")
        }else if(i==9){
			iTEXT.innerHTML = "~ 同意一下，拜托了&#10084;&#65039; ~";
			alert("给你买果冻 薯片 爆米花 水果糖 棒棒糖果脯、蜜饯 话梅、话李 干脆面 饼干 泡泡糖、口香糖 膨化小食品 葵花 花生 核桃 奶糖 芝麻糊 奶酪固齿 葡萄干 薄荷糖 无花果 南瓜子和开心果 柑桔、橙子、苹果 乳饮料 牛肉干、烤鱼片 香辣鳗鱼丝，香辣鱿鱼丝，香辣鱿鱼块，碳烤鱿鱼丝，香辣小银鱼，香辣红娘鱼，碳烤鱿鱼仔，泡椒鱿鱼须，碳烤鱿鱼足，蜜汁猪肉脯，麻辣猪肉铺，麻辣牛肉，牛肉丝，鹌鹑蛋，猪肉丝，xo牛肉粒，Q肉，QQ肠，秘制牛肉棒，独家牛肉，天椒麻牛，香辣猪脆骨，香辣牛板筋，果蔬干，芒果干，榴莲干，杨梅干，菠萝蜜，玉米粒，红枣片，香蕉片，金桔干，紫薯干，猕猴桃干，无花果干，草莓冻干，草莓蜜饯，柠檬蜜饯，秋葵干，蔬菜干，菠萝圈，香芋干，半边梅，水果冻干，海苔豆，盐津葡萄干，榴莲条冻干，藕片，黑加仑，蔓越莓沙琪玛，蔓越莓曲奇饼干，黄金肉松条，印尼威化饼干，椰丝米糕，椰蓉球，椰子酥，椰子片，蓝莓奶酪片，奶酪玉米棒，秘制豆腐干，甜甜圈，冰淇淋饼干，奶酪起司蛋糕， 可比克，妙脆角，雪丽糍，芝士条，艾比利，好丽友，好多鱼，徐福记，鲜虾片，粟米条。，荷兰豆，保龄豆，玉米花，烧贝壳，铜锣烧，瑞士莲，蛋黄派，卷卷芯，喜之郎.挤挤沙发，我带了果冻 薯片 爆米花 水果糖 棒棒糖果脯、蜜饯 话梅、话李 干脆面 饼干 泡泡糖、口香糖 膨化小食品 葵花 花生 核桃 奶糖 芝麻糊 奶酪固齿 葡萄干 薄荷糖 无花果 南瓜子和开心果 柑桔、橙子、苹果 乳饮料 牛肉干、烤鱼片 香辣鳗鱼丝，香辣鱿鱼丝，香辣鱿鱼块，碳烤鱿鱼丝，香辣小银鱼，香辣红娘鱼，碳烤鱿鱼仔，泡椒鱿鱼须，碳烤鱿鱼足，蜜汁猪肉脯，麻辣猪肉铺，麻辣牛肉，牛肉丝，鹌鹑蛋，猪肉丝，xo牛肉粒，Q肉，QQ肠，秘制牛肉棒，独家牛肉，天椒麻牛，香辣猪脆骨，香辣牛板筋，果蔬干，芒果干，榴莲干，杨梅干，菠萝蜜，玉米粒，红枣片，香蕉片，金桔干，紫薯干，猕猴桃干，无花果干，草莓冻干，草莓蜜饯，柠檬蜜饯，秋葵干，蔬菜干，菠萝圈，香芋干，半边梅，水果冻干，海苔豆，盐津葡萄干，榴莲条冻干，藕片，黑加仑，蔓越莓沙琪玛，蔓越莓曲奇饼干，黄金肉松条，印尼威化饼干，椰丝米糕，椰蓉球，椰子酥，椰子片，蓝莓奶酪片，奶酪玉米棒，秘制豆腐干，甜甜圈，冰淇淋饼干，奶酪起司蛋糕， 可比克，妙脆角，雪丽糍，芝士条，艾比利，好丽友，好多鱼，徐福记，鲜虾片，粟米条 ~")
		}else if(i==10){
			iTEXT.innerHTML = "~ 给你操&#128520; ~";
			alert("～让你为所欲为～")
			i=0;
		}
	}
	iOK.onclick=function(){
		alert("同意了，爱你呦~~~")
		window.location.href="./index1.html"; 
	}
}
